src/Catalogs/Scan_НоменклатураУслуг/Scan_НоменклатураУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_НоменклатураУслуг</name>
  <predefined>
    <items>
      <name>Доставка</name>
      <description>Доставка (перевозчик)</description>
    </items>
    <items>
      <name>ДоставкаЛьготная</name>
      <description>Доставка льготная</description>
    </items>
    <items>
      <name>ДоставкаЛьготнаяПоСкидке</name>
      <description>Доставка льготная расчет по скидке</description>
    </items>
    <items>
      <name>ДоставкаПолная</name>
      <description>Доставка полная</description>
    </items>
    <items>
      <name>УслугаПлатон</name>
      <description>Платон</description>
    </items>
    <items>
      <name>ПолисОСАГО</name>
      <description>Полис ОСАГО</description>
    </items>
    <items>
      <name>ПолучениеТранзитныхНомеров</name>
      <description>Получение транзитных номеров</description>
    </items>
  </predefined>
</mdclass:Catalog>

src/InformationRegisters/Scan_ЗначенияДанныхДляРасчетаУслугиПлатон/Scan_ЗначенияДанныхДляРасчетаУслугиПлатон.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ЗначенияДанныхДляРасчетаУслугиПлатон</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>КоэффициентВзиманияПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифОплатыЗа1Км</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ОснованиеИзменений</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействующийРазмерПлатыЗа1Км</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Scan_НоменклатураУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_СтоимостьУслугДляРасчетаСтоимостиДоставки/Scan_СтоимостьУслугДляРасчетаСтоимостиДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_СтоимостьУслугДляРасчетаСтоимостиДоставки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ОсновнаяУслуга</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Scan_НоменклатураУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef.Scan_СпособыДоставкиПродуктов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АдресПолучения</name>
    <type>
      <types>CatalogRef.Scan_АдресаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АдресДоставки</name>
    <type>
      <types>CatalogRef.Scan_АдресаХранения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Scan_НоменклатураУслуг/ManagerModule.bsl
//rarus tenkam 04.08.2017 mantis 10589 +++

// Функция - Запись данных для расчета услуги платон
//
// Параметры:
//  КоэффициентВзиманияПлаты	 - Число - 
//  ТарифОплатыЗа1Км			 - Число - 
//  ОснованиеВводаКоэффициента	 - Строка - 
//  НаДату						 - Дата - 
// 
// Возвращаемое значение:
//  Отказ - 
//
Функция ЗаписьДанныхДляРасчетаУслугиПлатон(КоэффициентВзиманияПлаты, ТарифОплатыЗа1Км, ОснованиеИзменений,ДействующийРазмерПлатыЗа1Км = Неопределено, НаДату = Неопределено) Экспорт
	
	Отказ = Ложь;
	
	Если НаДату = Неопределено Тогда
		ДатаЗаписи = ТекущаяДата();
	Иначе
		ДатаЗаписи = НаДату;
	КонецЕсли; 
	
	Если НЕ Отказ Тогда
		//Чтение старого значения регистра
		СтруктураОтбора = Новый Структура("Услуга", Справочники.Scan_НоменклатураУслуг.УслугаПлатон);
		СтруктураСведений = РегистрыСведений.Scan_ЗначенияДанныхДляРасчетаУслугиПлатон.ПолучитьПоследнее(ДатаЗаписи, СтруктураОтбора);
		СтарыйКоэффициент = СтруктураСведений.КоэффициентВзиманияПлаты;
		СтарыйТариф = СтруктураСведений.ТарифОплатыЗа1Км;
		Записывать = Ложь;
		
		//Введено значение, а старое отсутствует
		Если (ЗначениеЗаполнено(КоэффициентВзиманияПлаты) И СтарыйКоэффициент = Неопределено) ИЛИ
			(ЗначениеЗаполнено(ТарифОплатыЗа1Км) И СтарыйТариф = Неопределено)Тогда 
			Записывать = Истина; 
		КонецЕсли; 
		//Значение стерто, а старое значение было введено
		Если (НЕ ЗначениеЗаполнено(КоэффициентВзиманияПлаты) И СтарыйКоэффициент <> Неопределено) ИЛИ
			(НЕ ЗначениеЗаполнено(ТарифОплатыЗа1Км) И СтарыйТариф <> Неопределено) Тогда 
			Записывать = Истина; 
		КонецЕсли; 
		//Введено значение и было введено старое
		Если (ЗначениеЗаполнено(КоэффициентВзиманияПлаты) И СтарыйКоэффициент <> Неопределено) ИЛИ
			(ЗначениеЗаполнено(ТарифОплатыЗа1Км) И СтарыйТариф <> Неопределено) Тогда
			//Значение изменилось
			Если КоэффициентВзиманияПлаты <> СтарыйКоэффициент ИЛИ
				ТарифОплатыЗа1Км <> СтарыйТариф Тогда 
				Записывать = Истина; 
			КонецЕсли; 
		КонецЕсли; 
		Если Записывать Тогда
			//Значение какого-то параметра изменилось
			Если ДействующийРазмерПлатыЗа1Км = Неопределено Тогда
				ДействующийРазмерПлатыЗа1Км = Окр(ТарифОплатыЗа1Км*КоэффициентВзиманияПлаты,1);
			КонецЕсли;
			ЗаписьРегСведений = РегистрыСведений.Scan_ЗначенияДанныхДляРасчетаУслугиПлатон.СоздатьМенеджерЗаписи();
			ЗаписьРегСведений.Услуга	  				  = Справочники.Scan_НоменклатураУслуг.УслугаПлатон;
			ЗаписьРегСведений.КоэффициентВзиманияПлаты	  = КоэффициентВзиманияПлаты;
			ЗаписьРегСведений.ТарифОплатыЗа1Км    		  = ТарифОплатыЗа1Км;
			ЗаписьРегСведений.ДействующийРазмерПлатыЗа1Км = ДействующийРазмерПлатыЗа1Км;
			ЗаписьРегСведений.ОснованиеИзменений		  = ОснованиеИзменений;
			ЗаписьРегСведений.Период      				  = ДатаЗаписи;
			ЗаписьРегСведений.Пользователь				  = ПользователиКлиентСервер.ТекущийПользователь();
			
			Попытка
				ЗаписьРегСведений.Записать();
			Исключение
				//rarus FominskiyAS 19.04.2019  mantis 14191 +++
				//Сообщить(НСтр("ru = 'Ошибка записи данных для расчета услуги Платона в регистр сведений'"));
				Сообщить(НСтр("ru = 'Ошибка записи данных для расчета услуги Платона в регистр сведений'; en = 'Action failed '"));
				//rarus FominskiyAS 19.04.2019  mantis 14191 ---  				
				Отказ = Истина;
			КонецПопытки; 
		КонецЕсли; 
	КонецЕсли; 
		
	Возврат Отказ;
КонецФункции

Функция ЗаписьСтоимостейВРегистр(Услуга, Стоимость, СпособДоставки = Неопределено, АдресПолучения = Неопределено, АдресДоставки = Неопределено, ОсновнаяУслуга = Неопределено, НаДату = Неопределено) Экспорт
	
	Отказ = Ложь;
	
	Если НаДату = Неопределено Тогда
		ДатаЗаписи = ТекущаяДата();
	Иначе
		ДатаЗаписи = НаДату;
	КонецЕсли; 
	
	Если НЕ Отказ Тогда
		//Чтение старого значения регистра
		СтруктураОтбора = Новый Структура("Услуга", Услуга);
		// Если это Платон
		Если ЗначениеЗаполнено(СпособДоставки) Тогда
			СтруктураОтбора.Вставить("СпособДоставки", СпособДоставки);
		КонецЕсли;
		Если ЗначениеЗаполнено(АдресПолучения) Тогда
			СтруктураОтбора.Вставить("АдресПолучения", АдресПолучения);
		КонецЕсли;
		Если ЗначениеЗаполнено(АдресДоставки) Тогда
			СтруктураОтбора.Вставить("АдресДоставки", АдресДоставки);
		КонецЕсли;
		
		СтруктураСведений = РегистрыСведений.Scan_СтоимостьУслугДляРасчетаСтоимостиДоставки.ПолучитьПоследнее(ДатаЗаписи, СтруктураОтбора);
		СтараяСтоимость = СтруктураСведений.Стоимость;
		Записывать = Ложь;
		
		//Введено значение, а старое отсутствует
		Если (ЗначениеЗаполнено(Стоимость) И (СтараяСтоимость = Неопределено ИЛИ СтараяСтоимость = 0)) Тогда 
			Записывать = Истина; 
		КонецЕсли; 
		//Значение стерто, а старое значение было введено
		Если (НЕ ЗначениеЗаполнено(Стоимость) И (СтараяСтоимость <> Неопределено И СтараяСтоимость <> 0)) Тогда 
			Записывать = Истина; 
		КонецЕсли; 
		//Введено значение и было введено старое
		Если (ЗначениеЗаполнено(Стоимость) И (СтараяСтоимость <> Неопределено И СтараяСтоимость <> 0)) Тогда
			//Значение изменилось
			Если Стоимость <> СтараяСтоимость Тогда 
				Записывать = Истина; 
			КонецЕсли; 
		КонецЕсли; 
		Если Записывать Тогда
			//Значение какого-то параметра изменилось
			ЗаписьРегСведений = РегистрыСведений.Scan_СтоимостьУслугДляРасчетаСтоимостиДоставки.СоздатьМенеджерЗаписи();
			ЗаписьРегСведений.Услуга = Услуга;
			ЗаписьРегСведений.Стоимость = Стоимость;
			Если ЗначениеЗаполнено(СпособДоставки) Тогда
				ЗаписьРегСведений.СпособДоставки = СпособДоставки;
			КонецЕсли;
			Если ЗначениеЗаполнено(АдресПолучения) И ЗначениеЗаполнено(АдресДоставки) Тогда
				ЗаписьРегСведений.АдресПолучения = АдресПолучения;
				ЗаписьРегСведений.АдресДоставки = АдресДоставки;
			КонецЕсли;
			Если ОсновнаяУслуга <> Неопределено Тогда
				ЗаписьРегСведений.ОсновнаяУслуга = ОсновнаяУслуга;
			КонецЕсли;
			ЗаписьРегСведений.Период = ДатаЗаписи;
			ЗаписьРегСведений.Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
			Попытка
				ЗаписьРегСведений.Записать();
			Исключение
				//rarus FominskiyAS 19.04.2019  mantis 14191 +++
				//Сообщить(НСтр("ru = 'Ошибка записи данных стоимости услуг в регистр сведений'"));
				Сообщить(НСтр("ru = 'Ошибка записи данных стоимости услуг в регистр сведений'; en = 'Action failed '"));
				//rarus FominskiyAS 19.04.2019  mantis 14191 ---  
				Отказ = Истина;
			КонецПопытки; 
		КонецЕсли; 
	КонецЕсли; 
		
	Возврат Отказ;
КонецФункции

//rarus tenkam 04.08.2017 mantis 10589 ---
